## Updating Rows and Columns - Modifying Data Within DataFrames

In [30]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
}

In [31]:
import pandas as pd

In [32]:
df = pd.DataFrame(people)

In [33]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [34]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [35]:
df.columns = ['first_name', 'last_name', 'email'] # change column names

In [36]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [37]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [38]:
df.columns = [x.upper() for x in df.columns] # change column names to upper case
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [39]:
df.columns = df.columns.str.replace('_', ' ') # replace _ with space
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [40]:
df.columns = [x.lower() for x in df.columns] # change column names to lower case
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [41]:
df.rename(columns={'first name': 'first', 'last name': 'last'}, inplace=True) # rename columns
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [42]:
df.loc[2] = ['John', 'Smith', 'new_email.com'] # change row
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith            new_email.com

In [43]:
df.loc[0, ['last', 'email']] = ['Doe', 'Diagma@email.com'] # change cell
df

   first   last              email
0  Corey    Doe   Diagma@email.com
1   Jane    Doe  JaneDoe@email.com
2   John  Smith      new_email.com

In [45]:
df.loc[2, 'last'] = 'Doe'
df

   first last              email
0  Corey  Doe   Diagma@email.com
1   Jane  Doe  JaneDoe@email.com
2   John  Doe      new_email.com

#### [.at] is used for changing some data in exactly cell
#### [.loc/.iloc] is used for changing some data in row or column
#### We use [.at] for any single values cell, because there are can be following example: 
        
    `df.loc[5].at['B']`

In [49]:
df.at[2, 'last'] = 'Smith' # change cell
df

   first   last              email
0  Corey    Doe   Diagma@email.com
1   Jane    Doe  JaneDoe@email.com
2   John  Smith      new_email.com

In [56]:
filt = (df['email'] == 'new_email.com')
df.loc[filt, 'last'] = 'Meme' # We should not to write: dc[filt]['last'] = 'Meme'
df

   first  last              email
0  Corey   Doe   Diagma@email.com
1   Jane   Doe  JaneDoe@email.com
2   John  Meme      new_email.com

In [59]:
df ['email'] = df['email'].str.lower()
df

   first  last              email
0  Corey   Doe   diagma@email.com
1   Jane   Doe  janedoe@email.com
2   John  Meme      new_email.com

:

:

: